app/views/users/show.html.erb

    <div class="columns is-multiline">
      <% @user.recipes.each do |recipe| %>
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`user_id` = 1