app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT `recipes`.* FROM `recipes`

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 4 LIMIT 1

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    if @recipe.save
---
INSERT INTO `recipes` (`user_id`, `title`, `body`, `image_id`, `created_at`, `updated_at`) VALUES (1, 'test', 'おもろー', 'da1e9e1af606c9c2c0a0fc8b1c41d7b116b98c1c4a6a87b530c5773166df', '2021-09-10 08:19:20', '2021-09-10 08:19:20')

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 5 LIMIT 1

  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(recipe_params)
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 5 LIMIT 1
UPDATE `recipes` SET `title` = 'リョーマ！ The Prince of Tennis 新生劇場版テニスの王子様', `body` = '全国大会決勝の死闘を制した3日後、越前リョーマは更なる高みを目指して武者修行のために単身渡米する。しかし、LAに到着早々、家族旅行で来ていた同級生の竜崎桜乃が、ギャングに絡まれている場面に遭遇する。彼女を助けようと放ったボールがきっかけで、なんとリョーマと桜乃はタイムスリップ!!　辿り着いたのは、リョーマの父・越前南次郎が引退に追い込まれた全米オープン決勝の数日前。父の引退の理由を知るため、若き南次郎と行動を共にするリョーマたち。“サムライ南次郎”と呼ばれ、最強を誇った現役時代のプレーを目の当たりにし、胸躍らせるリョーマ。だがその時、桜乃が何者かに連れ去られてしまう。救出に向かうリョーマだったが、そこに規格外の強力な敵が現れ、熾烈なバトルに発展することに！　しかし、この事件は南次郎の引退に深く関わっていたのだったー。\r\n', `image_id` = 'fe4eb3814bc5dc37f89c007c2d0b0eafc693e5e2c791369c18e065580f71', `updated_at` = '2021-09-13 00:20:25' WHERE `recipes`.`id` = 4

  def destroy
    recipe = Recipe.find(params[:id])
    recipe.destroy
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
DELETE FROM `recipes` WHERE `recipes`.`id` = 1