app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `username` = 'atamaa', `profile_image_id` = '0840db3434919cc5faa7557b44bd571e44bc6f450580866a3f6ab77199ed', `updated_at` = '2021-09-10 07:50:22' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)